import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-pricing',
  templateUrl: './pricing.component.html',
  styleUrls: ['./pricing.component.css']
})
export class PricingComponent implements OnInit {

  constructor() { }

  ngOnInit(): void {
  }
  phone = '+380951211758';


  priceItems = [
      {
          title: 'Психологічне консультування',
          desc: 'Платформа надає кваліфікованого психолога для індивідуальної консультації. На першій зустрічі ви дізнаєтеся, з чим саме може допомогти спеціаліст, які підходи застосовуються у вашому випадку (КПТ, гештальт, психоаналіз тощо), а також як проходять консультації — формат, частота і тривалість.',
          price: '1 890 грн'
      },
      {
      title: 'Психологічне консультування',
      desc: 'Надання клієнту інформації про те, з чим працюють психологи, які є методи (КПТ, гештальт, психоаналіз тощо), яка тривалість і формат консультацій.',
      price: '1 690 грн'
    },
    {
      title: 'Підбір психолога за запитом клієнта',
      desc: 'Пошук і рекомендація фахівця відповідно до запиту, бюджету, мови, геолокації та інших побажань клієнта.',
      price: '1 300 грн'
    },
    {
      title: 'Інформація про методи психологічної допомоги',
      desc: 'Пояснення відмінностей між методами психологічної роботи (КПТ, гештальт, EMDR, системна терапія тощо) у доступній формі.',
      price: '900 грн'
    },
    {
      title: 'Інформаційна підтримка під час звернення до психолога',
      desc: 'Консультація щодо того, як сформулювати запит, що сказати на першій зустрічі, як працювати з очікуваннями.',
      price: '700 грн'
    },
    {
      title: 'Комунікація з психологом за дорученням клієнта',
      desc: 'Допомога у зв’язку з психологом, передача даних, узгодження часу або формату консультації (за згодою клієнта).',
      price: '1 180 грн'
    }
  ];


  print(){ window.print(); }
}
